Repository: david-shiko/rubik
Catalog: app/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: About
ru: О себе

source: Accept
ru: принять

source: Age
ru: Возраст

# ALAS_USER_NOT_FOUND
source: Unfortunately, user not found.
ru: Увы, пользователь не найден.

source: Allow
ru: Разрешить

# ASK_POST_ID
source: Please tell me post id.
ru: Сообщите мне пожалуйста id поста.

source: Back
ru: Назад

source: Cancel
ru: Отмена

source: Canceled.
ru: Отменено.

# COMMON_ERROR_EXPLANATION
source: Unknown error. Try again later. I am already working on it.
ru: Неизвестная ошибка. Попробуйте повторить попытку позднее. Я уже работаю над этим.

source: complete
ru: завершить

source: Completed.
ru: Завершено.

source: Continue
ru: Продолжить

source: Decline
ru: отклонить

source: Disallow
ru: Отказать

# EASTER_EGG_KEYBOARD
source: Secret: in Telegram you cannot edit a keyboard, so I will send a new message and delete it immediately.
ru: Секрет: в телеграмме нельзя редактировать клавиатуру, у которой есть кнопки, поэтому я отправлю новое сообщение с клавиатурой и тут же его удалю. Сообщение будет удалено, а клавиатура останется.

# ENTER_THE_NUMBER
source: Enter a number. For example: "25"
ru: Введите число. Например: "25"

# ERROR_LOCATION_SERVICE
source: Oops, location service is temporarily unavailable. Please enter your location manually or press "{SKIP_KEYWORD}".
ru: Упс, сервис геолокации временно недоступен. Пожалуйста, введи местоположение вручную или нажмите "{SKIP_KEYWORD}".

# ERROR_VOTE
source: I cannot leave a rating.
ru: Не могу оставить оценку.

# FAQ
source: What does the bot do? - The bot will find friends or a partner for you, and perhaps or not, love is a complex thing, it's worth a try anyway. How will it do this? - The bot will analyze your likes, thereby understanding your inner world. Presumably, two people with a common inner world form love, but this is not exact. How to use the bot? - The bot's operation consists of two spaces: 1. Personal space will show how many common interests you have with a specific person. (This could be a friend, girlfriend, or family member). 2. Public space will show people with the most common interests for you. (You can apply filters by gender, age, dating goal, etc.) I want to try personal space, how do I do this? - Command: "{{PERSONAL_SCENARIO_CMD}}". - 3 steps: 1. Rate personal posts (give likes or dislikes). 2. Indicate the person with whom you want to know the amount of common interests. 3. Done! The bot will conduct an analysis and tell the % of common interests and other interesting figures. I want to try public space, how do I do this? - Command: "{{GLOBAL_SCENARIO_CMD}}". - 3 steps: 1. Rate personal posts (give likes or dislikes). 2. Start a search for common interests and find out. 3. Done! - The bot will show people with the most common interests for you, and also apply the filters you set to them. What is the result of the bot's work? - The bot will show how many common interests you have with other users or a user. Based on this, you can make acquaintances. What do common interests give me? - Common interests are designed to help you make acquaintances with people, who are interesting to you and to whom you are interesting. This is a new filter that exists little elsewhere. Why like posts? - For the bot to be able to find you acquaintances based on interests - it needs to know your interests. Liking posts - is a way to tell the bot what you like. What does registration give me? - Registration allows other people to find you when they do a search. When you use the "{{SEARCH_CMD}}" command - you are looking for people who are already registered. For your profile to appear in the search results of other people - you need to register. {{BOT_NAME}}. Version 0.96. Author - {MAIN_ADMIN_NAME}.
ru: Что делает бот? - Бот найдет вам друзей ил пару, а возможно и нет, любовь штука мудреная, во всяком случае, стоит попробовать. Как он это сделает? - Бот будет анализировать ваши лайки, тем самым узнавая ваш внутренний мир. Предположительно, 2 человека с общим внутренним миром образуют любовь, но это не точно. Как пользоваться ботом? - Работа бота состоит из 2-х пространств: 1. Персональное пространство покажет сколько у вас общих интересов с конкретным человеком. (Это может быть друг, девушка или член семьи). 2. Публичное пространство покажет людей с наибольшим количеством общих для вас интересов. (Вы можете применить фильтры по полу, возрасту, цели знакомства и т.д.) Хочу попробовать персональное пространство, как мне это сделать? - Команда: "{{PERSONAL_SCENARIO_CMD}}". - 3 шага: 1. Оцените персональные посты (поставьте лайки или дизлайки). 2. Укажите человека, с которым хотите узнать количество общих интересов. 3. Готово! Бот проведет анализ и скажет % общих интересов и другие интересные цифры. Хочу попробовать публичное пространство, как мне это сделать? - Команда: "{{GLOBAL_SCENARIO_CMD}}". - 3 шага: 1. Оцените персональные посты (поставьте лайки или дизлайки). 2. Начните поиск по общим интересам и узнайте. 3. Готово! - Бот покажет людей с наибольшим количеством общих для вас интересов, а так-же применит к ним заданные вами фильтры. Каков результат работы бота? - Бот покажет сколько у вас общих интересов с другими пользователями или пользователем. На основе этого можно заводить знакомства. Что мне дают общие интересы? - Общие интересы призваны помочь заводить знакомства с людьми, которые вам интересны и которым вы интересны. Это новый фильтр, который мало где еще существует. Зачем лайкать посты? - Что бы бот смог найти вам знакомства по интересам - он должен узнать ваши интересы. Лайки постам - это способ рассказать боту что вам нравится. Что дает мне регистрация? - Регистрация позволяет другим людям найти вас когда они сделают поиск. Когда вы используете команду "{{SEARCH_CMD}}" - вы ищете людей, которые уже зарегистрированы. Что бы ваш профиль появлялся в результатах поиска у других людей - вам необходимо зарегистрироваться. {{BOT_NAME}}. Версия 0.96. Автор - {MAIN_ADMIN_NAME}.

# FORWARD
source: Go Ahead
ru: Вперед

# FOR_READY
source: To continue, type "{READY}".
ru: Для продолжения напишите "{READY}".

# FROM
source: out of
ru: из

source: Gender
ru: Пол

# GLOBAL_SCENARIO
source: Rate posts from collections. (In each collection maximum {{MAX_POSTS_COUNT}} posts). You can also rate posts in our posts channel: {{POSTS_CHANNEL_LINK}}.
ru: Оцените посты из коллекций. (В каждой коллекции максимум {{MAX_POSTS_COUNT}} постов). Так-же можно оценить посты на нашем канала с постами: {{POSTS_CHANNEL_LINK}}.

# GO
source: Let's go!
ru: Поехали!

source: Goal
ru: Цель

source: Goodbye!
ru: До новых встреч!

source: Help
ru: Помощь

# HERE_STATISTICS_WITH
source: Here is your statistics with user
ru: Вот ваша статистика с пользователем

# INCORRECT_CONTINUE
source: {MISUNDERSTAND} Write "{CONTINUE}" or "{CANCEL}".
ru: {MISUNDERSTAND} Напишите "{CONTINUE}" или "{CANCEL}".

# INCORRECT_FINISH
source: {MISUNDERSTAND} Write "{READY}" to move to the next step
ru: {MISUNDERSTAND} Напишите "Готово" что-бы перейти к следующему шагу

# INCORRECT_SEND
source: {MISUNDERSTAND} Write "{SEND}" or "{CANCEL}"
ru: {MISUNDERSTAND} Напишите "Отправить" или "Отмена"

# INCORRECT_USER
source: {MISUNDERSTAND} Send their contact or enter their user id. (Search by name (@nickname) is not available yet).
ru: Отправьте его контакт или введите его user id.

# I_AM_BOT
source: I am a bot. I am here to liven up this place in alpha versions.
ru: Я бот. Я здесь что бы оживить это место в альфа-версиях.

source: Location
ru: Местоположение

# POSSIBLE_LONG_SEARCH
source: (search is not optimized yet, it may be slow).
ru: (поиск еще не оптимизирован, он может быть долгим).

# MISUNDERSTAND
source: I do not understand you.
ru: Я вас не понимаю.

# MORE_ACTIONS
source: What else can be done?
ru: Что еще можно сделать?

source: Name
ru: Имя

# NICKNAME_SEARCH_NOT_IMPLEMENTED
source: (Search by name (@nickname) is not available yet)
ru: (Поиск по имени (@nickname) пока не доступен)

source: Pending
ru: В ожидании

# PERSONAL_SCENARIO
source: Step 1 of 2: Rate posts from collections. (In each collection maximum {{MAX_POSTS_COUNT}} posts). Skip - The search may not give results.
ru: Шаг 1 из 2: Оцените посты из коллекций. (В каждой коллекции максимум 10 постов). Пропустить - Возможно поиск не даст результата.

# POSSIBLE_INACTIVE_ACCOUNT
source: Maybe his account was deleted or blocked.
ru: Возможно он его аккаунт был удален или заблокирован.

source: Ready
ru: Готово

# REG_REQUIRED
source: Only registered users can use this command. "{REG_CMD}"
ru: Только зарегистрированные пользователи могут использовать эту команду. Команда для регистрации: "{REG_CMD}".

# REG_REQUIRED_FOR_VOTING
source: Only registered users can vote on posts. {TMP_RESTRICTION} {{REG_CMD}}
ru: Только зарегистрированные пользователи могут оценивать посты. {TMP_RESTRICTION} Команда для регистрации: "{{REG_CMD}}".

source: Send
ru: Отправить

source: Skip
ru: Пропустить

# START_SCENARIO
source: What do you want? Learn common interests with a friend or partner - - command "{PERSONAL_SCENARIO_CMD}" Find people with common interests with me - - command "{GLOBAL_SCENARIO_CMD}"
ru: Что вы хотите? Узнать общие интересы с другом или партнером - - команда "{PERSONAL_SCENARIO_CMD}". Найти людей с общими со мной интересами - - команда "{GLOBAL_SCENARIO_CMD}".

# STATISTIC_HELLO
source: Hello! With this command you can find out statistics with users who marked interests together with you. Send the contact of the user you want to get statistics for or enter their user id.
ru: Привет! С помощью этой команды можно узнать статистику с пользователями которые отмечали вместе с вами персональные посты. Отправьте контакт пользователя с которым хотите получить статистик или введите его user id.

# TEXT_TOO_LONG
source: Text is too long. Maximum characters allowed: {MAX_TEXT_LEN} Characters used: {USED_TEXT_LEN}
ru: Слишком длинный текст. Допустимое количество символов: {MAX_TEXT_LEN} Использовано символов: {USED_TEXT_LEN}

# TMP_RESTRICTION
source: (this is a temporary restriction, we will try to remove it soon)
ru: Это временное ограничение, мы постараемся его скоро убрать.

# UNCLICKABLE_BUTTON
source: This button does nothing.
ru: Эта кнопка ничего не делает.

source: Unknown
ru: Неизвестно

# UNSKIPPABLE_STEP
source: This step cannot be skipped.
ru: Этот шаг нельзя пропустить.

# USER_DECLINED_SHARE_PROPOSAL
source: Unfortunately, user {DECLINER_TG_NAME} declined your proposal.
ru: Увы, пользователь {DECLINER_TG_NAME} отклонил ваше приглашение.

# USER_DECLINED_REQUEST_PROPOSAL
source: Unfortunately, user {DECLINER_TG_NAME} declined your request.
ru: Увы, пользователь {DECLINER_TG_NAME} отклонил ваш запрос.

# USER_GOT_SHARE_PROPOSAL
source: User {USER_ID} received your invitation.
ru: Пользователь {USER_ID} получил ваше приглашение.

# USER_GOT_REQUEST_PROPOSAL
source: User {USER_ID} got your request.
ru: Пользователь {USER_ID} получил ваш запрос.

source: Wait
ru: ждать

# INTERNAL_ERROR
source: Internal error. We apologize.
ru: Внутренняя ошибка. Приносим свои извинения.
